<template>
  <p>
    Гара́нтия является одним из способов обеспечения исполнения обязательств одним субъектом перед другим(-и).
    Гара́нт — предоставляющий гарантии субъект; им может выступать государство, организация, предприятие, частное лицо. Субъект заявляет и принимает на себя меру ответственности (обязательства) за какие-либо обязательства или за качества и характеристики чего-либо.[1]
    Государство может предоставлять гарантии гражданам или юридическим лицам по соблюдению каких-либо обязательств.[1] Например, государственная гарантия — это обязательство государства перед гражданами или юридическими лицами, предполагающее предоставление материальных или нематериальных благ. А правовые гарантии — свод правил, в соответствии с которым государство должно уважать все законные права, принадлежащие человеку.
    Субъектом гарантии может выступать хозяйственная организация.[1] Например, банковская гарантия — один из способов обеспечения исполнения обязательств, при котором банк, иное кредитное учреждение, страховая организация или иная коммерческая организация (гарант) выдает по просьбе должника (принципала) письменное обязательство уплатить кредитору (бенефициару) денежную сумму при предоставлении им требования об её уплате.
    Как маркетинговый инструмент гарантия является показателем соответствия товара заявленным к продаже потребительским свойствам. Покупатель желает купить потребительские свойства товара, поэтому рассчитывает, что товар будет соответствовать заявленным продавцом свойствам. Продавец продаёт товар с определёнными потребительскими свойствами, соответствующими потребительским ожиданиям.[2][3] Предоставляя гарантию, продавец или производитель берёт на себя ответственность за качество потребительских свойств и функционирование товара в течение определённого срока и обязательство исправлять неисправности, за которые взята ответственность.[1] Так, гарантия на автомобиль — это обязательства официального дилера производить ремонт или замену детали, имеющей заводской дефект в течение оговорённого производителем гарантийного срока.
  </p>
</template>

<script>
export default {};
</script>